Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.23/edc/ATSAML22G17A.PIC
      <edc:SFRDef edc:_addr="0x42003C3C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C40" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SDATAH3" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C44" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C48" edc:access="----------------------nnnnnnnnnn" edc:cname="SDATAH4" edc:impl="0x3FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C4C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C50" edc:access="----------------------nnnnnnnnnn" edc:cname="SDATAH5" edc:impl="0x3FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C54" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C58" edc:access="------------------------nnnnnnnn" edc:cname="SDATAH6" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C5C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C60" edc:access="------------------------nnnnnnnn" edc:cname="SDATAH7" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C64" edc:access="----------wwwwwwwwwwwwwwwwwwwwww" edc:cname="ISDATA" edc:impl="0x3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SDMASK" edc:desc="Segments Data Mask" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="OFF" edc:desc="Byte Offset" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C68" edc:access="--------nnnnnnnnnnnnnnnn-----nnn" edc:cname="BCFG" edc:impl="0xFFFF07" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Blinking Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BLINKALL" edc:desc="Blink all segments" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BLINKSEL" edc:desc="Blink selected segments" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FCS" edc:desc="Frame Counter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FC0" edc:desc="Frame Counter 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FC1" edc:desc="Frame Counter 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FC2" edc:desc="Frame Counter 2" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BSS0" edc:desc="Blink Segment Selection 0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="BSS1" edc:desc="Blink Segment Selection 1" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C6C" edc:access="--------nnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="CSRCFG" edc:impl="0xFFFFF7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCS" edc:desc="Frame Counter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FC0" edc:desc="Frame Counter 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FC1" edc:desc="Frame Counter 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FC2" edc:desc="Frame Counter 2" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Circular Shift Register Size" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Circular Shift Register Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C70" edc:access="----nnnn" edc:cname="CMCFG" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="NSEG" edc:desc="Number of SEG lines" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DEC" edc:desc="Decrement SEG Line Index" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
